# FbxLightPhotometricFile Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..FbxLightPhotometricFile Property
ParameterTypeId Class See Also
---
"Photometric Web File"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId FbxLightPhotometricFile { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property FbxLightPhotometricFile As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ FbxLightPhotometricFile {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace